// See https://aka.ms/new-console-template for more information

namespace Lab1_2;

// Вариант №6 – radix – 100 баллов
// Разработайте программу radix.exe, выполняющую перевод чисел из одной произвольной системы счисления в другую произвольную и запись результата в стандартный поток вывода.
// Под произвольной системой счисления понимается система с основанием от 2 до 36.
// Системы счисления с 11-ричной до 36-ричной должны использовать заглавные буквы латинского алфавита от A до Z для представления разрядов с 1010 до 3510.
// Формат командной строки приложения:
//      radix.exe <source notation> <destination notation> <value>
// Например, следующим способом программа должна осуществлять перевод шестнадцатеричного числа 1F в его десятичное представление:
//      radix.exe 16 10 1F
class Program
{
    public static int Main(string[] args)
    {
        
        
        Console.WriteLine("Hello World!");
        return 0;
    }
}

